_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
complex_conv2d_25 (ComplexCo (None, 64, 64, 16)        160       
_________________________________________________________________
complex_conv2d_26 (ComplexCo (None, 32, 32, 16)        1168      
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 16)        80        
_________________________________________________________________
complex_conv2d_27 (ComplexCo (None, 16, 16, 32)        2336      
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 32)        160       
_________________________________________________________________
complex_conv2d_28 (ComplexCo (None, 8, 8, 64)          9280      
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 64)          320       
_________________________________________________________________
complex_conv2d_29 (ComplexCo (None, 4, 4, 128)         36992     
_________________________________________________________________
complex_batch_normalization_ (None, 4, 4, 128)         640       
_________________________________________________________________
complex_conv2d_30 (ComplexCo (None, 4, 4, 256)         147712    
_________________________________________________________________
complex_conv2d_31 (ComplexCo (None, 8, 8, 128)         147584    
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 128)         640       
_________________________________________________________________
complex_conv2d_32 (ComplexCo (None, 16, 16, 64)        36928     
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 64)        320       
_________________________________________________________________
complex_conv2d_33 (ComplexCo (None, 32, 32, 32)        9248      
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 32)        160       
_________________________________________________________________
complex_conv2d_34 (ComplexCo (None, 64, 64, 16)        2320      
_________________________________________________________________
complex_batch_normalization_ (None, 64, 64, 16)        80        
_________________________________________________________________
complex_conv2d_35 (ComplexCo (None, 64, 64, 16)        1168      
_________________________________________________________________
complex_conv2d_36 (ComplexCo (None, 64, 64, 2)         146       
=================================================================
Total params: 397,442
Trainable params: 396,242
Non-trainable params: 1,200
_________________________________________________________________
