_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
complex_conv2d_13 (ComplexCo (None, 64, 64, 8)         80        
_________________________________________________________________
complex_conv2d_14 (ComplexCo (None, 32, 32, 8)         296       
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 8)         40        
_________________________________________________________________
complex_conv2d_15 (ComplexCo (None, 16, 16, 16)        592       
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 16)        80        
_________________________________________________________________
complex_conv2d_16 (ComplexCo (None, 8, 8, 32)          2336      
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 32)          160       
_________________________________________________________________
complex_conv2d_17 (ComplexCo (None, 4, 4, 64)          9280      
_________________________________________________________________
complex_batch_normalization_ (None, 4, 4, 64)          320       
_________________________________________________________________
complex_conv2d_18 (ComplexCo (None, 4, 4, 128)         36992     
_________________________________________________________________
complex_conv2d_19 (ComplexCo (None, 8, 8, 64)          36928     
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 64)          320       
_________________________________________________________________
complex_conv2d_20 (ComplexCo (None, 16, 16, 32)        9248      
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 32)        160       
_________________________________________________________________
complex_conv2d_21 (ComplexCo (None, 32, 32, 16)        2320      
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 16)        80        
_________________________________________________________________
complex_conv2d_22 (ComplexCo (None, 64, 64, 8)         584       
_________________________________________________________________
complex_batch_normalization_ (None, 64, 64, 8)         40        
_________________________________________________________________
complex_conv2d_23 (ComplexCo (None, 64, 64, 8)         296       
_________________________________________________________________
complex_conv2d_24 (ComplexCo (None, 64, 64, 2)         74        
=================================================================
Total params: 100,226
Trainable params: 99,626
Non-trainable params: 600
_________________________________________________________________
