_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
complex_conv2d_1 (ComplexCon (None, 64, 64, 4)         40        
_________________________________________________________________
complex_conv2d_2 (ComplexCon (None, 32, 32, 4)         76        
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 4)         20        
_________________________________________________________________
complex_conv2d_3 (ComplexCon (None, 16, 16, 8)         152       
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 8)         40        
_________________________________________________________________
complex_conv2d_4 (ComplexCon (None, 8, 8, 16)          592       
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 16)          80        
_________________________________________________________________
complex_conv2d_5 (ComplexCon (None, 4, 4, 32)          2336      
_________________________________________________________________
complex_batch_normalization_ (None, 4, 4, 32)          160       
_________________________________________________________________
complex_conv2d_6 (ComplexCon (None, 4, 4, 64)          9280      
_________________________________________________________________
complex_conv2d_7 (ComplexCon (None, 8, 8, 32)          9248      
_________________________________________________________________
complex_batch_normalization_ (None, 8, 8, 32)          160       
_________________________________________________________________
complex_conv2d_8 (ComplexCon (None, 16, 16, 16)        2320      
_________________________________________________________________
complex_batch_normalization_ (None, 16, 16, 16)        80        
_________________________________________________________________
complex_conv2d_9 (ComplexCon (None, 32, 32, 8)         584       
_________________________________________________________________
complex_batch_normalization_ (None, 32, 32, 8)         40        
_________________________________________________________________
complex_conv2d_10 (ComplexCo (None, 64, 64, 4)         148       
_________________________________________________________________
complex_batch_normalization_ (None, 64, 64, 4)         20        
_________________________________________________________________
complex_conv2d_11 (ComplexCo (None, 64, 64, 4)         76        
_________________________________________________________________
complex_conv2d_12 (ComplexCo (None, 64, 64, 2)         38        
=================================================================
Total params: 25,490
Trainable params: 25,190
Non-trainable params: 300
_________________________________________________________________
