_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 64, 64, 8)         152       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 32, 32, 8)         584       
_________________________________________________________________
batch_normalization_9 (Batch (None, 32, 32, 8)         32        
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 16, 16, 16)        1168      
_________________________________________________________________
batch_normalization_10 (Batc (None, 16, 16, 16)        64        
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 8, 32)          4640      
_________________________________________________________________
batch_normalization_11 (Batc (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 4, 4, 64)          18496     
_________________________________________________________________
batch_normalization_12 (Batc (None, 4, 4, 64)          256       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 4, 4, 128)         73856     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 8, 8, 64)          73792     
_________________________________________________________________
batch_normalization_13 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 16, 16, 32)        18464     
_________________________________________________________________
batch_normalization_14 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 32, 32, 16)        4624      
_________________________________________________________________
batch_normalization_15 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 64, 64, 8)         1160      
_________________________________________________________________
batch_normalization_16 (Batc (None, 64, 64, 8)         32        
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 64, 64, 8)         584       
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 64, 64, 1)         73        
=================================================================
Total params: 198,553
Trainable params: 198,073
Non-trainable params: 480
_________________________________________________________________
