_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 64, 64, 16)        304       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 32, 32, 16)        2320      
_________________________________________________________________
batch_normalization_17 (Batc (None, 32, 32, 16)        64        
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 16, 16, 32)        4640      
_________________________________________________________________
batch_normalization_18 (Batc (None, 16, 16, 32)        128       
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 8, 8, 64)          18496     
_________________________________________________________________
batch_normalization_19 (Batc (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 4, 128)         73856     
_________________________________________________________________
batch_normalization_20 (Batc (None, 4, 4, 128)         512       
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 4, 4, 256)         295168    
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 8, 8, 128)         295040    
_________________________________________________________________
batch_normalization_21 (Batc (None, 8, 8, 128)         512       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 16, 16, 64)        73792     
_________________________________________________________________
batch_normalization_22 (Batc (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 32, 32, 32)        18464     
_________________________________________________________________
batch_normalization_23 (Batc (None, 32, 32, 32)        128       
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 64, 64, 16)        4624      
_________________________________________________________________
batch_normalization_24 (Batc (None, 64, 64, 16)        64        
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 64, 64, 16)        2320      
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 64, 64, 1)         145       
=================================================================
Total params: 791,089
Trainable params: 790,129
Non-trainable params: 960
_________________________________________________________________
