_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 64, 64, 4)         76        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 4)         148       
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 4)         16        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 8)         296       
_________________________________________________________________
batch_normalization_2 (Batch (None, 16, 16, 8)         32        
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 16)          1168      
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 8, 16)          64        
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 4, 4, 32)          4640      
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 4, 32)          128       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 4, 4, 64)          18496     
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 8, 8, 32)          18464     
_________________________________________________________________
batch_normalization_5 (Batch (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 16, 16, 16)        4624      
_________________________________________________________________
batch_normalization_6 (Batch (None, 16, 16, 16)        64        
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 32, 32, 8)         1160      
_________________________________________________________________
batch_normalization_7 (Batch (None, 32, 32, 8)         32        
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 64, 64, 4)         292       
_________________________________________________________________
batch_normalization_8 (Batch (None, 64, 64, 4)         16        
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 64, 64, 4)         148       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 64, 64, 1)         37        
=================================================================
Total params: 50,029
Trainable params: 49,789
Non-trainable params: 240
_________________________________________________________________
